#!/usr/bin/python

# Script to create a JSON skeleton out of the original FAQ text
# Copypaste everything from the official site into the faq variable
# You can then use the JSON skeleton in the FAQ +page.server.ts and translate things there

faq = """●LL14-041 SR 「高海 千歌」

　
●LL14-042 SR 「桜内 梨子」
●LL14-045 SR 「渡辺 曜」
●LL14-046 SR 「津島 善子」
●LL14-047 SR 「国木田 花丸」
●LL14-049 SR 「黒澤 ルビィ」

●コレクションってなに？
●LL14-043 SR 「松浦 果南」
●LL14-044 SR 「黒澤 ダイヤ」
●LL14-048 SR 「小原 鞠莉」

●カード（メンバー）が２つ以上のスキルを持っていたら？
●LL14-050 HR 「高海 千歌」
●LL14-051 HR 「桜内 梨子」

●カード（メンバー）が２つ以上のスキルを持っていたら？
●ペアってどういうこと？
●楽曲を開くのと【ライブ成功時】スキルはどちらが先？
●【ライブ参加時】【ライブ成功時】スキルの順番は？
●スキル欄が２つあるメンバーのスキルはなに？
●セットリストにある表向きの楽曲カードが増えていたら？
●「μ’s」の楽曲カードと「Aqours」の楽曲カードはどれのこと？

Q．セットリストにある表向きの楽曲カードが２枚のとき、LL14-050「高海 千歌」とLL14-051 「桜内 梨子」 がペアになり、【オート】スキルで裏向きのカード１枚を表向きにし、表向きの楽曲カードが３枚になりました。この場合、『このペアを参加させて《ライブ》してよい。』を行うことはできますか？
A．いいえ。この【オート】スキルはペアになったときにセットリストにある表向きのカードを数え、どちらか一方を行います。
●LL14-052 HR 「松浦 果南」
●LL14-053 HR 「黒澤 ダイヤ」
●LL14-057 HR 「小原 鞠莉」

●カード（メンバー）が２つ以上のスキルを持っていたら？
●トリオってどういうこと？
●スキル欄が２つあるメンバーのスキルはなに？
●メンバーの数え方はどうすればいいの？
●コレクションってなに？

Q．LL14-052「松浦 果南」、LL14-053「黒澤 ダイヤ」、LL14-057「小原 鞠莉」のトリオが、同じ楽曲カードの《ライブ》に２組参加しました。それぞれの【オート】スキルで♪ライブP＋１♪されますか？
A．はい。この【オート】スキルは１つにつき♪ライブP＋１♪されますので、この場合は合計で♪ライブP＋２♪されます。

Q．待機中のLL14-052「松浦 果南」がおり、待機中のLL14-053「黒澤 ダイヤ」がいないときに、LL14-057「小原 鞠莉」の【登場時】スキル『「1522 果南」「1523 ダイヤ」とトリオになる。』を行いました。この場合、LL14-052「松浦 果南」とLL14-057「小原 鞠莉」はトリオになりますか？
A．いいえ。待機中で、まだトリオになっていないLL14-052「松浦 果南」とLL14-053「黒澤 ダイヤ」が２人ともいる場合にのみ、トリオになります。
●LL14-054 HR 「渡辺 曜」

●コレクションってなに？

Q．『「渡辺 月」のメモリー』とは、どのカードのことを指しますか？
A．『「渡辺 月」のメモリー』は、カード名のなかに「渡辺 月」が含まれているメモリーカードを指します。
2019年6月現在、以下のカードが該当します。
・LL14-070「曜の従妹 渡辺 月」
・LL14-073「生徒会長 渡辺 月」
●LL14-055 HR 「津島 善子」

●コレクションってなに？

Q．LL14-069「天使ヨハネの導き」がないときにこのメンバーを《登場》し、【登場時】スキルで「天使ヨハネの導き」をステージに出しました。このメンバーは【RUSH】と【LIVE】のどちらを行えますか？
A．【RUSH】を行えます。【RUSH】と【LIVE】のどちらを行えるかは、スキルを使用する時点でどちらのアイコンになっているかで決まります。
●LL14-058 HR 「黒澤 ルビィ」

●コレクションってなに？

Q．【ライブ参加時】スキルは、具体的にどうすれば使用できますか？
A．LL14-071「ラブライブ！決勝延長戦」の【オート】スキルやLL07-055「近未来ハッピーエンド」の【ライブ成功時】スキルによって、《ライブ》を行ったターンにこのメンバーを参加させてもう１回《ライブ》を行ったときに使用できます。
なお、LL05-063「MIRAI TICKET」のスキルのように『もう１回ターンを行う。』の場合は、追加のターンに《ライブ》を行っても、別々のターンに１回ずつ《ライブ》を行っているためこのスキルの条件を満たしません。
●LL14-059 HR 「鹿角 聖良」
●LL14-060 HR 「鹿角 理亞」

●カード（メンバー）が２つ以上のスキルを持っていたら？
●ペアってどういうこと？
●セットリストにある表向きの楽曲カードが増えていたら？
●スキル欄が２つあるメンバーのスキルはなに？
●コレクションってなに？
●LL14-061 M 「僕らの走ってきた道は…」

●【ライブ参加時】【ライブ成功時】スキルの順番は？
●LL14-062 M 「逃走迷走メビウスループ」

●メンバーの数え方はどうすればいいの？
●LL14-063 M 「Hop? Stop? Nonstop!」

●【ライブ参加時】【ライブ成功時】スキルの順番は？

Q．自分のステージにメモリーがあるとき、この楽曲カードの【ライブ参加時】スキルでメモリーをコレクションに戻さないで《ライブ》することはできますか？
A．いいえ。あなたのステージにメモリーがある場合は、必ずすべてのメモリーをコレクションに戻します。
●LL14-065 M 「Brightest Melody」

●【ライブ参加時】【ライブ成功時】スキルの順番は？
●【ライブ参加時】に増えたり変わったりしたピースはその後どうなる？

Q．【ライブ参加時】スキルで、ライブ衣装が「Brightest Melody」のメンバーのピースをすべて【オール】にしました。この《ライブ》が成功した後、LL14-074「みんなと共に、その先の未来へ！」の【オート】スキルでライブ衣装が「Brightest Melody」のメンバーをさらに《ライブ》に参加させた場合、後から加わったメンバーのピースも【オール】になりますか？
A．いいえ。この楽曲カードの【ライブ参加時】スキルは、スキルを行った時点でいるメンバーのみ、ピースを【オール】にします。
●LL14-066 M 「キセキヒカル」

Q．この楽曲カードの《ライブ》に参加するメンバーが持つ【☆】の合計が１０個あります。共通スコアはどうなりますか？
A．０になります。（共通スコアは０未満にはなりません。）また、この楽曲カードの《ライブ》に【☆】の合計が１０個以上になるようにメンバーを参加させても問題ありません。
●LL14-067 M 「Next SPARKLING!!」

●メンバーの数え方はどうすればいいの？

Q．この楽曲カードの《ライブ》にメンバーが６人参加しました。その《ライブ》が成功した後、LL14-074「みんなと共に、その先の未来へ！」の【オート】スキルを行い、【ライブ中】スキルの条件『この《ライブ》に参加しているメンバーがちょうど９人で、それぞれ名前が異なる』を満たした場合、♪ライブP＋１♪されますか？
A．はい。【ライブ中】スキルは、《ライブ》の後からでも条件を満たせば追加ライブPがもらえます。
●LL14-068 ME 「MISSING!!」

●【ライブ参加時】【ライブ成功時】スキルの順番は？

Q．このメモリーはどのカードのスキルでステージに出せますか？
A．LL14-057「小原 鞠莉」の【登場時】スキルでステージに出せます。

Q．『【オート】あなたはデッキからメンバーを《登場》できない。』とは、どういうことですか？
A．ターンの行動、スキルのいずれによっても、デッキからメンバーを《登場》できなくなります。（手札から《登場》することはできます。）
なお、スキルの一部がデッキからメンバーを《登場》しようとする場合、その部分だけができなくなります。例えば、LL05-046「高海 千歌」のスキルを行うとき、あなたの手札が０枚、ほかの待機中のメンバーが０人であれば、デッキの１番上のカードは《登場》できませんが、カードを３枚引くことはできます。

Q．《ライブ》が成功し、このメモリーの【オート】スキル『「鞠莉」が参加しているあなたの《ライブ》が成功したとき、このメモリーをコレクションに戻す。』と、ほかの【ライブ成功時】スキルが使用可能になりました。この場合、先に【オート】スキルを行ってこのメモリーをコレクションに戻し、さらに【オート】スキル『このメモリーがコレクションに戻ったとき、カードを２枚引く。』を行ってカードを引いてから、ほかの【ライブ成功時】スキルを行えますか？
A．はい。スキルを行う前に、ほかに使用可能なスキルが増えた場合、好きなものから順番に行えます。
例えば、《ライブ》が成功し、このメモリーの【オート】スキルと、LL10-080「小原 鞠莉」の【ライブ成功時】スキルが使用可能になった場合、先に【オート】スキルを両方行ってカードを引き、後から引いてきたメンバーをLL10-080「小原 鞠莉」の【ライブ成功時】スキルで《登場》できます。
●LL14-069 ME 「天使ヨハネの導き」

●【ライブ参加時】【ライブ成功時】スキルの順番は？

Q．このメモリーはどのカードのスキルでステージに出せますか？
A．LL14-055「津島 善子」の【登場時】スキルでステージに出せます。

Q．『【RUSH】は【LIVE】に、【LIVE】は【RUSH】に入れ替わる』とは、具体的にどういうことですか？
A．もともと【RUSH】を持っているメンバーは【LIVE】を行い、もともと【LIVE】を持っているメンバーは【RUSH】を行います。

Q．「善子」を含まないメンバーを参加させて《ライブ》をする場合、このメモリーはコレクションに戻りますか？
A．はい。《ライブ》に参加するメンバーの中に「善子」がいるかどうかに関わらず、あなたが《ライブ》するときはこのメモリーをコレクションに戻します。（「善子」が参加しない場合、＋【クール】【クール】はされません。）

Q．【オート】スキルによって【LIVE】が【RUSH】に入れ替わっていたLL14-055「津島 善子」が手札やデッキに移動しました。移動した後、そのメンバーは【RUSH】と【LIVE】のどちらを持っていますか？
A．【LIVE】を持っています。このメモリーのスキルはステージにいる間にのみ有効で、ステージを離れた場合は元の状態に戻ります。
●LL14-070 ME 「曜のいとこ 渡辺 月」

●【ライブ参加時】【ライブ成功時】スキルの順番は？
Q．このメモリーはどのカードのスキルでステージに出せますか？
A．LL14-054「渡辺 曜」の【登場時】スキルでステージに出せます。

Q．『あなたのコレクションにある「生徒会長 渡辺 月」１枚とこのメモリーを入れ替えてよい。』とはどういうことですか？
A．このメモリーをコレクションに戻して、コレクションからLL14-073「生徒会長 渡辺 月」をステージに出すことができます。（「生徒会長 渡辺 月」をステージに出さずにこのメモリーをコレクションに戻したり、このメモリーをコレクションに戻さずに「生徒会長 渡辺 月」をステージに出すことはできません。）

Q．LL05-056「決めたよHand in Hand」のように、ライブPに「３＋１」のように書いてある楽曲カードをライブ中なら、このスキルは有効ですか？
A．はい。基本ライブＰと追加ライブＰの合計が４以上であれば有効です。ただし、追加ライブＰを獲得するための条件を満たしている必要があります。

Q．LL05-056「決めたよHand in Hand」のように、ライブPに「３＋１」のように書いてある楽曲カードの《ライブ》が成功しましたが、その時点では【ライブ中】スキルの条件を満たしていませんでした。そこでLL14-074「みんなと共に、その先の未来へ！」の【オート】スキルを行い、後から「決めたよHand in Hand」の【ライブ中】スキルの条件を満たしました。この場合、このメモリーの【オート】スキルでLL14-073「生徒会長 渡辺 月」と入れ替えることはできますか？
A．はい。【オート】スキルを行うときに条件を満たしていれば、入れ替えることができます。
●LL14-071 ME 「ラブライブ！決勝延長戦」

●【ライブ参加時】【ライブ成功時】スキルの順番は？

Q．このメモリーはどのカードのスキルでステージに出せますか？
A．LL14-058「黒澤 ルビィ」の【登場時】スキルでステージに出せます。

Q．このメモリーがステージにあるとき、LL11-063「MY舞☆TONIGHT」のように『《ライブ》してよい。』と書かれた【ライブ成功時】スキルを持つ楽曲カードを《ライブ》しました。この場合、このメモリーの【オート】スキルと、「MY舞☆TONIGHT」の【ライブ成功時】スキルの両方で《ライブ》できますか？
A．はい。このメモリーの【オート】スキルとLL11-063「MY舞☆TONIGHT」の【ライブ成功時】スキルの好きな方から順に、両方とも《ライブ》できます。
●LL14-072 ME 「変わらない思い」

Q．このメモリーはどのカードのスキルでステージに出せますか？
A．LL14-060「鹿角 理亞」とLL14-059「鹿角 聖良」の【ライブ成功時】スキルでステージに出せます。

Q．このメモリーがステージにあるとき、通常スコアの楽曲カードの《ライブ》にLL10-060「鹿角 理亞」が参加し、【ライブ参加時】スキルで＋【クール】されました。この【クール】のピースも、このメモリーの【オート】スキル『あなたの通常スコアの楽曲カードの《ライブ》に参加する「理亞」の【クール】のピースをすべて【オール】にする。』によって【オール】になりますか？
A．はい。条件を満たした《ライブ》に参加する「理亞」のピースは、追加された時点で【オール】になります。
●LL14-073 ME 「生徒会長 渡辺 月」

●【ライブ参加時】【ライブ成功時】スキルの順番は？

Q．このメモリーはどのカードのスキルでステージに出せますか？
A．LL14-070「曜のいとこ 渡辺 月」の【オート】スキルでステージに出せます。
（なお、LL14-070「曜のいとこ 渡辺 月」はLL14-054「渡辺 曜」の【登場時】スキルでステージに出せます。）
●LL14-074 ME 「みんなと共に、その先の未来へ！」

●【ライブ参加時】【ライブ成功時】スキルの順番は？

Q．このメモリーはどのカードのスキルでステージに出せますか？
A．以下のカードの【登場時】スキルでステージに出せます。
・LL14-041「高海 千歌」
・LL14-042「桜内 梨子」
・LL14-045「渡辺 曜」
・LL14-046「津島 善子」
・LL14-047「国木田 花丸」
・LL14-049「黒澤 ルビィ」

Q．LL14-067「Next SPARKLING!!」の《ライブ》にメンバーが６人参加しました。《ライブ》が成功した後、このメモリーの【オート】スキルを行い、「Next SPARKLING!!」の【ライブ中】スキルの条件『この《ライブ》に参加しているメンバーがちょうど９人で、それぞれ名前が異なる』を満たした場合、♪ライブP＋１♪されますか？
A．はい。LL14-067「Next SPARKLING!!」の【ライブ中】スキルは、《ライブ》の後からでも条件を満たせば追加ライブPがもらえます。

Q．ほかの【ライブ成功時】スキルでメンバーを数える場合、このメモリーの【オート】スキルを先に行って、数えるメンバーを増やせますか？
A．はい。メンバーの人数などを数えるスキルは、そのスキルを行うときに数えます。
例えばLL07-063「HAPPY PARTY TRAIN」であれば、【ライブ成功時】スキルを行う前にこのメモリーの【オート】スキルでライブ衣装が「HAPPY PARTY TRAIN」のメンバーを３人参加させれば、さらにもう１回ターンを行うことができます。

Q．【オート】スキルで、メンバーを３人ではなく、１人や２人を《登場》することはできますか？
A．いいえ。メンバーを《登場》する場合は、必ず３人を《登場》します。あなたのコレクションに条件に合うメンバーが３人いない場合は《登場》できません。
●LL14-075 SP 「高海 千歌」　～　LL14-092 SEC 「黒澤 ルビィ」

Q．『【スタート時】/【登場時】』とは、どういうことですか？
A．このメンバーをスタートメンバーにしてゲームを始めたときと、このメンバーが《登場》したときの両方でこのスキルを使用できます。"""

import json, random

faq = [x.strip() for x in faq.split("\n")] + ["●LLEND"]
i = 0
curSec = { "subjects": [] }
res = []
while i < len(faq):
    if len(faq[i]) == 0:
        i += 1
        continue
    if faq[i][:3] == "●LL" or faq[i][:3] == "●EX" or faq[i][:3] == "●PR":
        if "seeAlso" in curSec or "qa" in curSec:
            if "qa" in curSec and len(curSec["qa"]) > 1:
                curSec["qa"] = [{"key": str(random.random())[2:], "question": qa["question"], "answer": qa["answer"]} for qa in curSec["qa"]]
            res.append(curSec)
            curSec = { "subjects": [] }
        subjlen = 6 if faq[i][:3] == "●PR" else 8
        if "～" in faq[i]:
            subjs = [x.strip() for x in faq[i][1:].split("～")]
            curSec["subjects"].append({
                    "from": subjs[0][:subjlen],
                    "to": subjs[1][:subjlen]
                })
        else:
            curSec["subjects"].append(faq[i][1:1+subjlen])
        i += 1
    elif faq[i][0] == "●":
        if not "seeAlso" in curSec: curSec["seeAlso"] = []
        if faq[i] == "●「ステージにいるメンバー」って誰のこと？": curSec["seeAlso"].append("/faq/general#members_on_stage")
        elif faq[i] == "●コレクションってなに？": curSec["seeAlso"].append("/faq/general#collection")
        elif faq[i] == "●「μ’s」の楽曲カードと「Aqours」の楽曲カードはどれのこと？": curSec["seeAlso"].append("/faq/general#muse_and_aqours_song_cards")
        elif faq[i] == "●セットリストにある表向きの楽曲カードが増えていたら？": curSec["seeAlso"].append("/faq/general#more_faceup_songs")
        elif faq[i] == "●メンバーの数え方はどうすればいいの？": curSec["seeAlso"].append("/faq/general#member_counting")
        elif faq[i] == "●「待機中」ってどういう状態？": curSec["seeAlso"].append("/faq/general#stand_by")
        elif faq[i] == "●【ライブ参加時】【ライブ成功時】スキルの順番は？": curSec["seeAlso"].append("/faq/general#join_success_order")
        elif faq[i] == "●楽曲を開くのと【ライブ成功時】スキルはどちらが先？": curSec["seeAlso"].append("/faq/general#flip_before_skills")
        elif faq[i] == "●スコアよりも多いピースで《ライブ》してもいい？": curSec["seeAlso"].append("/faq/general#live_non_exact")
        elif faq[i] == "●メンバーが２つ以上のスキルを持っていたら？": curSec["seeAlso"].append("/faq/general#skill_order_multiple_skills")
        elif faq[i] == "●ペアってどういうこと？": curSec["seeAlso"].append("/faq/general#group")
        elif faq[i] == "●スキル欄が２つあるメンバーのスキルはなに？": curSec["seeAlso"].append("/faq/general#group_skill_field")
        elif faq[i] == "●デッキの１番上のカードを表向きにしたら？": curSec["seeAlso"].append("/faq/general#top_deck_card_faceup")
        elif faq[i] == "●スキルでセットリストにある表向きのカードを裏向きにしたら？": curSec["seeAlso"].append("/faq/general#no_shuffle_facedown_song")
        elif faq[i] == "●【ライブ参加時】に増えたり変わったりしたピースはその後どうなる？": curSec["seeAlso"].append("/faq/general#live_join_pieces")
        elif faq[i] == "●カードが２つ以上のスキルを持っていたら？": curSec["seeAlso"].append("/faq/general#skill_order_multiple_skills")
        elif faq[i] == "●カード（メンバー）が２つ以上のスキルを持っていたら？": curSec["seeAlso"].append("/faq/general#skill_order_multiple_skills")
        elif faq[i] == "●トリオってどういうこと？": curSec["seeAlso"].append("/faq/general#group")
        else: raise Exception("Add link for this See Also (line " + str(i+1) + "): " + faq[i])
        i += 1
    else:
        if faq[i][0] != "Q" and faq[i][0] != "Ｑ": raise Exception("Expected question, but wasn't (line " + str(i+1) + "): " + faq[i])
        q = [faq[i][2:].strip()]
        i += 1
        while faq[i][0] != "A" and faq[i][0] != "Ａ":
            q.append(faq[i].strip())
            i += 1
        
        a = [faq[i][2:].strip()]
        i += 1
        while len(faq[i]) > 0 and faq[i][0] != "Q" and faq[i][0] != "Ｑ" and faq[i][0] != "●":
            a.append(faq[i].strip())
            i += 1
        
        if not "qa" in curSec: curSec["qa"] = []
        curSec["qa"].append({
            "question": "<br>".join(q),
            "answer": "<br>".join(a)
        })

# Not outputting straight via json.dumps - instead making sure it matches the format already used for other FAQ JSON
print(",")
print("    \"SET\": [")
print("        {")
for i in range(len(res)):
    if i > 0:
        print("        }, {")
    print("            subjects: " + json.dumps(res[i]["subjects"]) + ",")
    if "seeAlso" in res[i]:
        print("            seeAlso: " + json.dumps(res[i]["seeAlso"]) + ("," if "qa" in res[i] else ""))
    if "qa" in res[i]:
        l = ["            " + x.encode("utf-8").decode("unicode-escape").replace('"key"', 'key').replace('"question"', 'question').replace('"answer"', 'answer').replace('"', '`') for x in json.dumps(res[i]["qa"], indent=4).split("\n")]
        l[0] = "            qa: " + l[0].strip()
        for ll in l: print(ll)
print("        }")
print("    ]")
